# ruff: noqa: E501
from database.models.enums import BaseAliasEnum


__all__ = ["WorkFormatEnum"]


# fmt: off
class WorkFormatEnum(BaseAliasEnum):
    UNKNOWN = "Неизвестно", ("полный день", "разъездной", "гибкий график")
    REMOTE = "Удалёнка", ("удалённо", "удаленная работа", "удалённая работа", "удалено", "удаленка", "удаленна", "удалённая", "удаленная", "удаленно", "удалённый", "remote", "удаленный", "полностью удалённая")
    HYBRID = "Гибрид", ("гибридный", "гибридно", "гибридно")
    OFFICE = "Офис", ("на месте работодателя", "офисный", "на месте работадателя")
# fmt: on
